/* Имя: null.c
 * Проект: тестирование возможностей драйвера
 * Автор: Christian Starkjohann
 * Дата создания: 2008-04-29
 * Табуляция: 4
 * Copyright: (c) 2008 by OBJECTIVE DEVELOPMENT Software GmbH
 * Лицензия: GNU GPL v2 (см. License.txt) или проприетарная (CommercialLicense.txt)
 * Ревизия: $Id: null.c 573 2008-04-29 17:41:25Z cs $
 */

/*
Это просто пустая (NULL) функция main(), нужная для определения размера кода, требуемого для libusb
 startup, векторов прерывания, и т. п.
*/
#include <avr/io.h>


/* ------------------------------------------------------------------------- */

int	main(void)
{
    for(;;);
	return 0;
}

/* ------------------------------------------------------------------------- */
